// 리뷰 상세 데이터
const reviewData = {
  1: `
    <h3>전기쟁이 님의 후기</h3>
    <p>
      우선 지난 약 3개월동안 지옥같은 생활에서 벗어나게 해주신 법무법인 영민 대표변호사님과 송영욱 국장님께 먼저 고개숙여 감사의 말씀드립니다.
      몇날몇일 어두운방에서 불안과 공포에 떨고있던 중 우연히 유투브를 통해 알게된 이곳,,, 바로 법무법인 영민 그리고 송국장님.      
      전화로 시작된 첫상담...그와중 늦어도 괜찮으니 한번 사무실 방문을 권장하여 찾아간 사무실..정말 친형님같이 편안하게 저를 안정시켜주셨던 국장님.. 
      지금처해있는 상황을 말씀드리니 해결책을 바로그자리에서 안내해주셨던 대표변호사님과 국장님...그 후 하나부터 열까지 시키는 대로만 했을뿐인데 지금 이렇게 이용후기 까지 적게 되었네요...       
      처음에 소액으로 시작한 개인사채빛... 정신차려보니 감당할수 없도록 불어나 있는 개인사채 빛. 정말 남들이 말하는 잘못된 생각을 몇번이나 했던 저...      
      이전에도 빛때문에 부모님, 가족 모두에게 힘들게했던터라 이번엔 정말...      
      이글을 읽고계신 개인사채로 힘들어하시는 분들이라면 지금 당장 법무법인 영민의 송국장님께 연락하여 상담먼저 받아보세요...길이 보일껍니다.
      그냥 말씀해주신대로 시키는대로 하기만 하면 됩니다.
      독촉은 물론 이미 과다하게 지불한 이자의 일부지만 환급까지 해결해주십니다.      
      늦지않았습니다.. 지금바로 찾아가세요...      
      아직 모든게 완전히 끝나진 않았지만 앞으로 약한마음 접어두고 법무법인 영민만 믿고 경찰서까지 간다는 마음으로 마무리해볼 생각입니다.      
      이번계기로 연로하신 부모님외 모든 가족께 사죄하는 마음으로 헛눈팔지않고 새로운 인생 후회없이 살아보겠습니다.      
      다시한번 대표변호사님과 송국장님께 감사의 말씀 드립니다..
    </p>
  `,
  2: `
    <h3>희망을품고 님의 후기</h3>
    <p>
      회생중이고 정말 막막하고  답도 없는 상환에 기댈곳도 나올 데도 없는 상황에 마지막 혹시나하고 상담 받고 너무 감사했습니다
      이자내기 바쁘고  회생 낼돈 없어  다시 빌리고 그러던 차에 우연히 알게된
      돈워리  만나게 되서 정말 다행이고 행운이였습니다. 송국장님의 친절하고 자세한 상담으로 신청 하게되었어요.
      늦었다 생각마세요. 더 빨리 알았다면 좋았을걸
      채무종결,,부당이득금 반환 까지 합의해서 받아주시고 생각지도 못했는데 너무 너무 감사합니다.
      송국장님 믿고 하라는데로 대체하니 정말 생각지도 못한 반환금도 받고 이제 다리 쭉펴고 잘려고요
      모두 다 종료 시켜주셨어요. 너무 감사드립니다.
      너무 무섭고 걱정했는데 친절하게 상담해주시고 안심 시켜주셔서 믿고 맡길 수 있었어요! 너무 감사드립니다! 
    </p>
  `,
  3: `
    <h3>꼬니 님의 후기</h3>
    <p>
      제발 용기내서 채무자대리인 신청하시길 바랍니다.
      매일같이 상환해야하는 문자에 이리저리 힘들게 
      돌려막고 1년가까이 고생하다 검색을 통해 
      사무장님을 알게됐습니다.
      늦은 시간까지 친절하게 상담해주시고 겁내지 말라고 
      계속 얘기해주시고 하루아침에  모든게 정리되더라구요.
      진작에 알았다면 더 커지지 않고 빨리 끝났을텐데
      무지했었네요..
      사무장님께 정말 다시한번 감사드립니다.
      힘드신 분들 하루라도 더 빨리 편안해지시길 바랍니다.! 
    </p>
  `,
  4: `
    <h3>ㅎㅎㅎ 님의 후기</h3>
    <p>
      먼저 법무법인 영민 및 국장님 너무 감사드립니다.
      다른 법무법인보다 훨씬 체계적이세요.
      그리고 채무자 편에서 든든하고 친절하게 상담해주십니다.
      다른곳에 의뢰했다가 오히려 추심협박 더 세게 들어오고, 채무대리인은 그냥 무시하라고만 하고.. 감정도 상하고 결과도 안좋았어요.      
      그래서 이번엔 더 알아보고 여기에 의뢰했어요
      거래내역을 다 입력해서 이자율계산까지 해주시는게 이거 결과물보면 현타 세게 옵니다.. 
      내 자신이 한심하기도 하고 이 많은 돈이 업자들한테 갔다는게 눈물나고요
      선임비도 좀 부족했는데 계약금도 조정하주셔서 하루만에 다 정리됐습니다.
      오늘 받은 반환금으로 잔금정리도 다 했어요.
      이번에 다른데 맡겼다가 협박당하고 종결도 안된 건들도 영민에 다시 의뢰하려고 합니다
      정말 감사드려요.      
      돈 한푼이 아쉬워서 길거리 분식도 못사먹었는데 오늘 반환금 받은걸로 붕어빵 사먹으려고요ㅎㅎ 정말 감사합니다.
    </p>
  `
};

// 리뷰 클릭 → 아코디언 열기
function openReview(id) {
  const box = document.getElementById("reviewAccordion");
  const content = document.getElementById("reviewContent");

  content.innerHTML = reviewData[id];
  box.style.display = "block";

  // 부드럽게 스크롤 이동
  box.scrollIntoView({ behavior: "smooth" });
}
